tests/raw-responses/payment/payment_list.json

{
  "payments": [
    {
      "id": "ae5e8c6a-1622-45a5-b7ca-9ead69be722e",
      "status": "paid",
      "amount": 7000,
      "fee": 325,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "fee_format": "3.25 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": "915fc838-f2c6-46ec-be44-4a93c9500f5f",
      "ip": null,
      "callback_url": "https://dashboard.moyasar.com/invoices/915fc838-f2c6-46ec-be44-4a93c9500f5f/cc",
      "created_at": "2019-07-09T17:38:05.431Z",
      "updated_at": "2019-07-09T17:38:11.050Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "Power Rangers",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Succeeded!",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/3f99d8fd-9b5b-430a-9f32-ee4e73c8f5da/form",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "e19918db-b042-4c39-b6e1-ae3f6498a0da",
      "status": "paid",
      "amount": 7000,
      "fee": 325,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "fee_format": "3.25 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": "739639b0-913b-408f-88f6-44affd547e7a",
      "ip": null,
      "callback_url": "https://dashboard.moyasar.com/invoices/739639b0-913b-408f-88f6-44affd547e7a/cc",
      "created_at": "2019-07-09T14:25:03.255Z",
      "updated_at": "2019-07-09T14:25:08.069Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Do",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Succeeded!",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/543a97f5-185c-4e73-8a39-6d549f66b764/form",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "4af9e0f7-eda2-41eb-9979-9e1d6cca42ff",
      "status": "paid",
      "amount": 7000,
      "fee": 325,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "fee_format": "3.25 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": "de5680b0-d3e8-4646-9af6-53d141c51575",
      "ip": null,
      "callback_url": "https://dashboard.moyasar.com/invoices/de5680b0-d3e8-4646-9af6-53d141c51575/cc",
      "created_at": "2019-07-09T13:26:13.272Z",
      "updated_at": "2019-07-09T13:26:17.974Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Succeeded!",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/6f3527dd-ff5f-4256-84bc-027ebbca5ad3/form",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "e6b54aca-2882-4dc6-b771-237205e875ed",
      "status": "paid",
      "amount": 1000,
      "fee": 175,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "fee_format": "1.75 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": "627aa8af-cad7-4f2c-b090-634c1c4de00e",
      "ip": null,
      "callback_url": "https://dashboard.moyasar.com/invoices/627aa8af-cad7-4f2c-b090-634c1c4de00e/cc",
      "created_at": "2019-07-02T16:35:40.327Z",
      "updated_at": "2019-07-02T16:35:46.082Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Succeeded!",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/4076b603-2dc3-4113-b84c-6b7c46c418e1/form",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "7dd16219-fcc3-4396-abdf-79262baa72da",
      "status": "paid",
      "amount": 1000,
      "fee": 175,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "fee_format": "1.75 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": "a1031e54-a812-4469-9569-8715d6d85cce",
      "ip": null,
      "callback_url": "https://dashboard.moyasar.com/invoices/a1031e54-a812-4469-9569-8715d6d85cce/cc",
      "created_at": "2019-05-20T21:30:06.104Z",
      "updated_at": "2019-05-20T21:30:11.230Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Succeeded!",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/d677ad86-809b-4d30-a353-006bd8ec0140/form",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "ae23fa05-5d5b-49c7-b152-94bc7e26db41",
      "status": "paid",
      "amount": 1000,
      "fee": 175,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "fee_format": "1.75 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": "0bb22109-2101-4e14-820d-3808898a109a",
      "ip": null,
      "callback_url": "https://dashboard.moyasar.com/invoices/0bb22109-2101-4e14-820d-3808898a109a/cc",
      "created_at": "2019-05-20T21:12:53.745Z",
      "updated_at": "2019-05-20T21:13:00.723Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Succeeded!",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/ebebe6eb-eab8-4534-998d-835e663d4fee/form",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "2c878715-fbaf-4620-bdc9-9fcfbfb51235",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:54:43.029Z",
      "updated_at": "2019-02-11T13:00:05.198Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/40ce96f7-6396-43fc-ba74-4412ede22373/form?token=auth_LgPFN5rkuHpeHRShHGvWWVLBAMSZjWbmpbPmgJVrSx1",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "24a2ac86-038b-4644-8469-2c3100ddb8bd",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:54:18.256Z",
      "updated_at": "2019-02-11T13:00:05.179Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/ebb8a976-e7cd-40c7-83cc-a06fc9ea8337/form?token=auth_ESVUfTwHBdssp8owy8EjjbThHZGq4RLFtNkzZjw7HKH",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "8b7db962-5313-4bdd-8091-75a36fe75c79",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:52:56.658Z",
      "updated_at": "2019-02-11T13:00:05.253Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/21e527ac-aa71-4feb-a0c9-76b658e93a78/form?token=auth_mc8Wr3AB9a67BqJEvaG7UsxLCvRqPRT5LX9gKpKRxDX",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "4969c3b2-6a04-42c8-b9ab-27c9bea04886",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:52:50.776Z",
      "updated_at": "2019-02-11T13:00:05.234Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/9eeef68a-96a8-4a69-bec1-dfece8d08c0d/form?token=auth_EGoU3fDJ8VRsi1ritn3ykzf6RUGPBkZopR5RU69X7qg",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "1af11a62-2045-4cdb-97f4-738be41f9152",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:52:45.338Z",
      "updated_at": "2019-02-11T13:00:05.156Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/d04a7540-6bba-4c19-904e-c14ff99a46c1/form?token=auth_iGxSPe7qXXSbU3XqmJELkEMimLQXEWZmCTt6Yrc8qhd",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "d6ced8a2-049d-4a6a-bb2b-d40e025b63db",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:52:29.565Z",
      "updated_at": "2019-02-11T13:00:05.271Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/79a2c5bb-7abe-49f0-af0a-ad4847d6f714/form?token=auth_cRv2G91Viv6f7vowHQz44EfEAwM5pMcDFrc9naPAsXQ",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "3f2c50cf-aa6a-4f76-9f8d-0b964e761dc5",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:52:28.223Z",
      "updated_at": "2019-02-11T13:00:05.216Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/c4458e46-1a24-4f50-8ae1-5b417a1b59bf/form?token=auth_noqcTvbHgR66Arquy8K9gGCF9FVZADBv84d8J1r9EoT",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "df4fae1b-3ed5-4984-a625-a55de53605df",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:50:08.738Z",
      "updated_at": "2019-02-11T13:00:05.289Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/f4e272f4-641b-44a5-9160-0d286266c03d/form?token=auth_Mihb5YT2scxwT3XzbDk8wvaQJWWEzVraFBLvCKY4x8K",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "af279f8a-92ae-433b-aa64-4c800cb5d938",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:49:31.074Z",
      "updated_at": "2019-02-11T12:59:31.106Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/6756c3a6-358e-47fa-ae85-063ee58dbc7b/form?token=auth_DAGEmdJnAvH59z6dRfxscNSBn5VhRTfWHNBCEUQYdjv",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "59c16245-6dbd-4bf2-af2f-ced8041bf345",
      "status": "failed",
      "amount": 10000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": null,
      "amount_format": "100.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "https://www.my-store.com/payments_redirect",
      "created_at": "2019-02-11T12:42:40.267Z",
      "updated_at": "2019-02-11T12:52:40.297Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "John Doe",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/ce9e5632-dc36-49c4-a164-1072cd1ee258/form?token=auth_Cx9zHcbkXVX7VeMeS7MvZr3fvEf99Yu4caaBYCH1oVi",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "e3a78264-1817-4972-9222-1c530754384d",
      "status": "failed",
      "amount": 7000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "http://www.example.com/payment_callback",
      "created_at": "2019-02-06T20:29:54.713Z",
      "updated_at": "2019-02-06T20:39:54.781Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "Ali Alhoshaiyan",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/e8383207-420b-4abd-992b-052f0a33eebb/form?token=auth_FcdUT8Ubn1LMZ29n1vwpxnn93VY76gZSowNZw6sDLXT",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "e2bbb1fe-dd44-47b1-93de-a295e34455f0",
      "status": "failed",
      "amount": 7000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "http://www.example.com/payment_callback",
      "created_at": "2019-02-06T20:28:02.696Z",
      "updated_at": "2019-02-06T20:38:02.726Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "Ali Alhoshaiyan",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/f8ed9db7-d606-4ee7-9fd4-fa16ec2cf03b/form?token=auth_bUUcT64Bn3v5HWPtuATEhAx8176WFd1q8JdhQCecUbN",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "d520726f-6721-436f-b0d5-55d2365ccf57",
      "status": "failed",
      "amount": 7000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "http://www.example.com/payment_callback",
      "created_at": "2019-02-06T20:27:35.678Z",
      "updated_at": "2019-02-06T20:37:35.706Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "Ali Alhoshaiyan",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/9297659c-b251-48b6-b47e-f2a2d89429eb/form?token=auth_8bWw5gvtRaujDipkHsKTBzuNH69wZk9NXW3J4aBLf3x",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    },
    {
      "id": "f60b6365-4f65-4d39-9c1d-b01af2d9f3db",
      "status": "failed",
      "amount": 7000,
      "fee": 0,
      "currency": "SAR",
      "refunded": 0,
      "refunded_at": null,
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "fee_format": "0.00 SAR",
      "refunded_format": "0.00 SAR",
      "invoice_id": null,
      "ip": null,
      "callback_url": "http://www.example.com/payment_callback",
      "created_at": "2019-02-06T20:26:57.638Z",
      "updated_at": "2019-02-06T20:36:57.672Z",
      "source": {
        "type": "creditcard",
        "company": "visa",
        "name": "Ali Alhoshaiyan",
        "number": "XXXX-XXXX-XXXX-1111",
        "message": "Allowed time frame for transaction has been expired.",
        "transaction_url": "https://api.moyasar.com/v1/transaction_auths/5cd2c752-a048-409b-af8a-ba3f02f51d57/form?token=auth_Pq2jQdXkC58HSs2S2oqaJSVYoaWXHAvyFMr72UaY39J",
        "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
        "reference_number": "125478454231"
      }
    }
  ],
  "meta": {
    "current_page": 1,
    "next_page": 2,
    "prev_page": null,
    "total_pages": 3,
    "total_count": 47
  }
}
