tests/raw-responses/payment/payment_updated.json

{
  "id": "ae5e8c6a-1622-45a5-b7ca-9ead69be722e",
  "status": "paid",
  "amount": 7000,
  "fee": 325,
  "currency": "SAR",
  "refunded": 7000,
  "refunded_at": "2019-07-10T17:38:05.431Z",
  "captured": 0,
  "captured_at": null,
  "voided_at": null,
  "description": "Updated Desc",
  "amount_format": "70.00 SAR",
  "fee_format": "3.25 SAR",
  "refunded_format": "70.00 SAR",
  "captured_format": "0.00 SAR",
  "invoice_id": "915fc838-f2c6-46ec-be44-4a93c9500f5f",
  "ip": null,
  "callback_url": "https://dashboard.moyasar.com/invoices/915fc838-f2c6-46ec-be44-4a93c9500f5f/cc",
  "created_at": "2019-07-09T17:38:05.431Z",
  "updated_at": "2019-07-09T17:38:11.050Z",
  "source": {
    "type": "creditcard",
    "company": "visa",
    "name": "Power Rangers",
    "number": "XXXX-XXXX-XXXX-1111",
    "message": "Succeeded!",
    "transaction_url": "https://api.moyasar.com/v1/transaction_auths/3f99d8fd-9b5b-430a-9f32-ee4e73c8f5da/form",
    "gateway_id": "moyasar_ap_je1iUidxhrh74257S891wvW",
    "reference_number": "125478454231"
  }
}
